name: "finetune caption model"
input: "data"
input_shape {
  dim: 10
  dim: 715
}
layer {
  name: "reshape-data"
  type: "Reshape"
  bottom: "data"
  top: "data-reshape"
  reshape_param {
    shape {
      dim: 1
      dim: -1
      dim: 715
    }
  }
}
